package com.common;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum TestUserEnum {
    ATEzbch("1454819962050001","ATEzbch","T-招标策划","13655666001","1","zbch"),
    ATEct("1454819962050002","ATEct","T-出图","13655666002","1","chut"),
    ATEjswjsb("1454819962050003","ATEjswjsb","T-技术文件-设备","13655666003","1","jswjsb"),
    ATEjswjxg("1454819912050001","ATEjswjxg","T-技术文件-项管","13655616665","1","jswjxg"),
    ATEjxwjzj("1454819922050001","ATEjxwjzj","T-技术文件-质监","13655626665","1","jswjzj"),
    ATEcqd("1454819962050004","ATEcqd","T-出清单","13655666004","1","cqd"),
    ATEzbwj("1454819962050005","ATEzbwj","T-招标文件","13655666005","1","zbwj"),
    ATEdwrw("1454819962050006","ATEdwrw","T-单位入围","13655666006","1","dwrw"),
    ATEzbwjdwrw("1454819962050005","ATEzbwj","T-招标文件","13655666005","1","zbwjdwrw"),
    ATEfb("1454819962050007","ATEfb","T-发标","13655666007","1","fab"),
    ATEdy("1454819962050008","ATEdy","T-答疑","13655666008","1","day"),
    ATEhb("1454819962050009","ATEhb","T-回标","13655666009","1","huib"),
    ATEpjsb("1454819962050010","ATEpjsb","T-评技术标","13655666010","1","pjsb"),
    ATEpingb("1454819962050010","ATEpjsb","T-评技术标","13655666010","1","pingb"),
    ATEpswb("1454819962050011","ATEpswb","T-评商务标","13655666011","1","pswb"),
    ATEelhb("1454819962050012","ATEelhb","T-二轮回标","13655666012","1","huib2"),
    ATEelpb("1454819962050013","ATEelpb","T-二轮评标","13655666013","1","pswb2"),
    ATEdb("1454819962050014","ATEdb","T-定标","13655666014","1","dingb"),
    ATEfqd("1454819962050015","ATEfqd","T-返清单","13655666015","1",""),
    ATEqy("1454819962050016","ATEqy","T-签约","13655666016","1","qiany"),
    ATEhtjd("1454819962050017","ATEhtjd","T-合同交底","13655666017","1",""),

    ATEzbjbr("1454819932050001","ATEzbjbr","T-招标经办人","13655636665","2",""),
    
    ATEswpbr1("1454819962150001","ATEswpbr1","T-评商务标评标人1","13655666018","3",""),
    ATEswpbr2("1454819962150002","ATEswpbr2","T-评商务标评标人2","13655666019","3",""),
    ATEswpbr3("1454819962150003","ATEswpbr3","T-评商务标评标人3","13655666020","3",""),
    ATEswpbr4("1454819962150004","ATEswpbr4","T-评商务标评标人4","13655666021","3",""),
    ATEswpbr5("1454819962150005","ATEswpbr5","T-评商务标评标人5","13655666022","3",""),
    ATEswpbr6("1454819962150006","ATEswpbr6","T-评商务标评标人6","13655666023","3",""),
    ATEswpbr7("1454819962150007","ATEswpbr7","T-评商务标评标人7","13655666024","3",""),
    ATEswpbr8("1454819962150008","ATEswpbr8","T-评商务标评标人8","13655666025","3",""),
    ATEswpbr9("1454819962150009","ATEswpbr9","T-评商务标评标人9","13655666026","3",""),
    ATEjspbr1("1454819962250001","ATEjspbr1","T-评技术标评标人1","13655666027","3",""),
    ATEjspbr2("1454819962250002","ATEjspbr2","T-评技术标评标人2","13655666028","3",""),
    ATEjspbr3("1454819962250003","ATEjspbr3","T-评技术标评标人3","13655666029","3",""),
    ATEjspbr4("1454819962250004","ATEjspbr4","T-评技术标评标人4","13655666030","3",""),
    ATEjspbr5("1454819962250005","ATEjspbr5","T-评技术标评标人5","13655666031","3",""),
    ATEjspbr6("1454819962250006","ATEjspbr6","T-评技术标评标人6","13655666032","3",""),
    ATEjspbr7("1454819962250007","ATEjspbr7","T-评技术标评标人7","13655666033","3",""),
    ATEjspbr8("1454819962250008","ATEjspbr8","T-评技术标评标人8","13655666034","3",""),
    ATEjspbr9("1454819962250009","ATEjspbr9","T-评技术标评标人9","13655666035","3",""),

    ;


    private String userId;
    private String username;
    private String realname;
    private String phone;
    // 1-采购过程节点经办人  2-计划经办人（采购过程经办人）（采购外层）   3-评标打分参与人
    private String type;
    private String bidNodeCode;


}
